In [5]:
import pandas as pd
data=pd.read_csv("sample1.csv")
data

  name  age  marks gender   dept
0    a   16     98      f    cse
1    b   12     91      m    ece
2    c   10     90      f   mech
3    d   19     88      f  civil
4    f    6     98      m    eee
5    k   18     77      m   mech
6    y    9     80      m    cse
7    i    7     85      f    cse
8    l   17     72      f    eee
9    h   14     64      m  civil

In [8]:
data.groupby("gender")

In [10]:
a=data.groupby("gender")
a.groups

{'f': [0, 2, 3, 7, 8], 'm': [1, 4, 5, 6, 9]}

In [12]:
a=data.groupby("dept")
a.groups

{'civil': [3, 9], 'cse': [0, 6, 7], 'ece': [1], 'eee': [4, 8], 'mech': [2, 5]}

In [13]:
b=data.groupby(["gender","dept"])
b.groups

{('f', 'civil'): [3], ('f', 'cse'): [0, 7], ('f', 'eee'): [8], ('f', 'mech'): [2], ('m', 'civil'): [9], ('m', 'cse'): [6], ('m', 'ece'): [1], ('m', 'eee'): [4], ('m', 'mech'): [5]}

In [19]:
data.groupby(["dept"]).max("age")

       age  marks
dept
civil   19     88
cse     16     98
ece     12     91
eee     17     98
mech    18     90

In [20]:
data.groupby("dept").sum()

       age  marks
dept
civil   33    152
cse     32    263
ece     12     91
eee     23    170
mech    28    167

In [24]:
data.groupby("dept").sum("marks")

       age  marks
dept
civil   33    152
cse     32    263
ece     12     91
eee     23    170
mech    28    167

In [25]:
data.groupby("gender").max()

       name  age  marks  dept
gender
f         l   19     98  mech
m         y   18     98  mech

In [28]:
data.groupby("gender").min("age")

        age  marks
gender
f         7     72
m         6     64

In [30]:
g=data.groupby("dept")
g.get_group("cse")

  name  age  marks gender dept
0    a   16     98      f  cse
6    y    9     80      m  cse
7    i    7     85      f  cse

In [31]:
data["gender"].value_counts()

f    5
m    5
Name: gender, dtype: int64

In [32]:
data["dept"].value_counts()

cse      3
mech     2
civil    2
eee      2
ece      1
Name: dept, dtype: int64

In [35]:
data["marks"].value_counts()

98    2
91    1
90    1
88    1
77    1
80    1
85    1
72    1
64    1
Name: marks, dtype: int64